from jinja2 import Template

user_main_menu_tm = Template("""
Жужелица — ваш проводник в интернет без ограничений.

📱 Доступ к любым социальным сетям
🤫 Устойчивость к блокировкам
🚀 Без ограничения по скорости
💳 Оплата через сервис электронных платежей Юmoney
🌐 Доступ к российским сервисам с активированным VPN
💬 Оперативная поддержка 24/7 в любом вопросе.

/info для более подробной информации
""")

buy_subscription_tm = Template("""
Выберите количество месяцев* на которое вы хотите купить или продлить подписку

Цена: 50р/месяц

<i>*Месяцем считается 30-дневный период</i>
""")

xray_url = Template("""
<pre>vless://6efdc299-cfc1-47e2-a5d1-52f5d1f4b1b5@95.182.122.43:443?security=reality&encryption=none&alpn=h2&pbk=
6z8Zc9mwmes3LX6iijrwJynZzjTmszjp5IIWOqvaSA4&headerType=none&fp=chrome&type=tcp&flow=xtls-rprx-vision&sni=
www.yahoo.com&sid=14a2a8e1387d1f4f#rus</pre>
""")

ios_foxray_instruction = Template("""
1. Копируем полученную ссылку
2. Скачиваем из applestore программу foXray
3. В программе нажимаем значок планшета 📋
4. Нажимаем разрешить вставку и потом ОК
5. Готово! Что бы включить нажимаем на значок ▶️
""")

ios_streisand_instruction = Template("""
1. Копируем полученную ссылку
2. Скачиваем из applestore программу Streisand
3. В программе сверху справа нажимаем значок ➕
4. Выбираем "Вставить из буфера"
5. Готово! Что бы включить нажимаем значок ▶️
""")

android_v2ray_instruction = Template("""
1. Копируем полученную ссылку
2. Скачиваем из google play программу v2rayNG
3. Нажимаем сверху значок ➕
4. Выбираем "Импорт из буфера"
5. Готово! Что бы включить нажимаем снизу на значок 🇻
""")

windows_invisible_man = Template("""

""")
